---
kind: type
id: T:Autodesk.Revit.DB.Analysis.PathOfTravel
source: html/99c2bb04-151f-c325-84b2-40dee81447d6.htm
---
# Autodesk.Revit.DB.Analysis.PathOfTravel

An element which holds a graphical representation of the shortest route between two points in the plane of a floor plan view.
 The shortest route is calculated to go around model geometry visible in the view.
 Route calculation is affected by properties of the RouteAnalysisSettings element.

## Syntax (C#)
```csharp
public class PathOfTravel : Element
```